Конфигурация отчетов/Documents/СообщениеПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>СообщениеПользователя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/СообщениеПользователя/Ext/ManagerModule.bsl
Процедура ЗаписатьСообщениеПользователя(ТекстСообщения, Отправитель,СсылкаНаПроект) Экспорт
	
	ДокСообщения = Документы.СообщениеПользователя.СоздатьДокумент();
	ДокСообщения.Дата = ТекущаяДата();
	ДокСообщения.ТекстСообщения = СокрЛП(ТекстСообщения);
	ДокСообщения.Отправитель = Отправитель;
	ДокСообщения.СсылкаНаПроект = СсылкаНаПроект;
	ДокСообщения.Записать(РежимЗаписиДокумента.Запись);
	
КонецПроцедуры
